Revit 2025 API
EnergyAnalysisOpening.GetWindowType Method
 Gets the analytic window type this surface is associated with. Null when this surface is not a window.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public EnergyAnalysisWindowType GetWindowType()
Public Function GetWindowType As EnergyAnalysisWindowType
public:
EnergyAnalysisWindowType^ GetWindowType()
member GetWindowType : unit -> EnergyAnalysisWindowType
Return Value
EnergyAnalysisWindowType
 The analytic window type.
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace